app/views/subjects/index.html.erb

SELECT "subjects".* FROM "subjects"   ORDER BY subjects.position ASC
SELECT COUNT(*) FROM "subjects"
---

  <div><%= pluralize(@subjects.size, 'subject') %> found</div>