app/controllers/pages_controller.rb

  def new
    @page = Page.new({:name => "Default"})
    @subjects = Subject.order('position ASC')
    @page_count = Page.count + 1
---
SELECT "subjects".* FROM "subjects"   ORDER BY position ASC
SELECT COUNT(*) FROM "pages"

  def create
    @page = Page.new(page_params)
    if @page.save
      flash[:notice] = "Page created successfully."
      redirect_to(:action => 'index')
    else
      @subjects = Subject.order('position ASC')
      @page_count = Page.count + 1
---
INSERT INTO "pages" ("created_at", "name", "permalink", "position", "subject_id", "updated_at", "visible") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["created_at", "2018-03-25 18:25:06.928720"], ["name", "Default"], ["permalink", "hello"], ["position", 1], ["subject_id", 1], ["updated_at", "2018-03-25 18:25:06.928720"], ["visible", "t"]]
SELECT "subjects".* FROM "subjects"   ORDER BY position ASC
SELECT COUNT(*) FROM "pages"

  def edit
    @page = Page.find(params[:id])
    @subjects = Subject.order('position ASC')
    @page_count = Page.count
---
SELECT  "pages".* FROM "pages"  WHERE "pages"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "subjects".* FROM "subjects"   ORDER BY position ASC
SELECT COUNT(*) FROM "pages"

  def update
    @page = Page.find(params[:id])
    if @page.update_attributes(page_params)
---
SELECT  "pages".* FROM "pages"  WHERE "pages"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "pages" SET "permalink" = $1, "position" = $2, "subject_id" = $3, "updated_at" = $4, "visible" = $5 WHERE "pages"."id" = 1  [["permalink", "helli"], ["position", 2], ["subject_id", 2], ["updated_at", "2018-03-26 06:42:31.249090"], ["visible", "f"]]

  def delete
    @page = Page.find(params[:id])
---
SELECT  "pages".* FROM "pages"  WHERE "pages"."id" = $1 LIMIT 1  [["id", 2]]

  def destroy
    page = Page.find(params[:id]).destroy
---
SELECT  "pages".* FROM "pages"  WHERE "pages"."id" = $1 LIMIT 1  [["id", 2]]